performance/jmeter/ecossistema-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Ecossistema Load Test" enabled="true">
      <stringProp name="TestPlan.comments">Load test for all 4 backend APIs — 100 concurrent users</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>

      <!-- User-Defined Variables -->
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="SGC_HOST" elementType="Argument">
            <stringProp name="Argument.name">SGC_HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="SGC_PORT" elementType="Argument">
            <stringProp name="Argument.name">SGC_PORT</stringProp>
            <stringProp name="Argument.value">8081</stringProp>
          </elementProp>
          <elementProp name="SI_PORT" elementType="Argument">
            <stringProp name="Argument.name">SI_PORT</stringProp>
            <stringProp name="Argument.value">8082</stringProp>
          </elementProp>
          <elementProp name="WN_PORT" elementType="Argument">
            <stringProp name="Argument.name">WN_PORT</stringProp>
            <stringProp name="Argument.value">8083</stringProp>
          </elementProp>
          <elementProp name="GPJ_PORT" elementType="Argument">
            <stringProp name="Argument.name">GPJ_PORT</stringProp>
            <stringProp name="Argument.value">8084</stringProp>
          </elementProp>
          <elementProp name="TOKEN" elementType="Argument">
            <stringProp name="Argument.name">TOKEN</stringProp>
            <stringProp name="Argument.value">${__property(auth.token)}</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>

      <!-- =========== SGC API Thread Group =========== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="SGC API - 100 Users" enabled="true">
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <stringProp name="ThreadGroup.duration">300</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Auth Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Authorization" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${TOKEN}</stringProp>
            </elementProp>
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- GET /cidadaos (paginated) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Cidadaos List" enabled="true">
          <stringProp name="HTTPSampler.domain">${SGC_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SGC_PORT}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/cidadaos</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="page" elementType="HTTPArgument">
                <stringProp name="Argument.name">page</stringProp>
                <stringProp name="Argument.value">0</stringProp>
              </elementProp>
              <elementProp name="size" elementType="HTTPArgument">
                <stringProp name="Argument.name">size</stringProp>
                <stringProp name="Argument.value">20</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- GET /vistos (paginated) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Vistos List" enabled="true">
          <stringProp name="HTTPSampler.domain">${SGC_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SGC_PORT}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/vistos</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <!-- GET /agendamentos -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Agendamentos List" enabled="true">
          <stringProp name="HTTPSampler.domain">${SGC_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SGC_PORT}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/agendamentos</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time" enabled="true">
          <stringProp name="ConstantTimer.delay">1000</stringProp>
        </ConstantTimer>
        <hashTree/>
      </hashTree>

      <!-- =========== SI Public API Thread Group =========== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="SI Public API - 100 Users" enabled="true">
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <stringProp name="ThreadGroup.duration">300</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- GET /public/pages -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Pages" enabled="true">
          <stringProp name="HTTPSampler.domain">${SGC_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SI_PORT}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/public/pages</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <!-- GET /public/events -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Events" enabled="true">
          <stringProp name="HTTPSampler.domain">${SGC_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SI_PORT}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/public/events</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
        </ConstantTimer>
        <hashTree/>
      </hashTree>

      <!-- =========== WN Public API Thread Group =========== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="WN Public API - 100 Users" enabled="true">
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <stringProp name="ThreadGroup.duration">300</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- GET /public/articles -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Articles" enabled="true">
          <stringProp name="HTTPSampler.domain">${SGC_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${WN_PORT}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/public/articles</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <!-- GET /public/categories -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Categories" enabled="true">
          <stringProp name="HTTPSampler.domain">${SGC_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${WN_PORT}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/public/categories</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
        </ConstantTimer>
        <hashTree/>
      </hashTree>

      <!-- =========== Listeners =========== -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <stringProp name="filename">results/summary.csv</stringProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <stringProp name="filename">results/aggregate.csv</stringProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>